---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionUnlockedAndUnequaled
source: html/d59ce1b7-96b8-da6e-0768-453d3f8a6deb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionUnlockedAndUnequaled Property

Dimension had to be unlocked in order to remove sketch over-constraining.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimensionUnlockedAndUnequaled { get; }
```